{
  "_name_or_path": "ModernBERT-base",
  "architectures": [
    "ModernBertForMaskedLM"
  ],
  "attention_bias": false,
  "attention_dropout": 0.1,
  "deterministic_flash_attn": false,
  "embedding_dropout": 0.1,
  "decoder_bias": true,
  "classifier_activation": "gelu",
  "classifier_bias": false,
  "classifier_dropout": 0.1,
  "classifier_pooling": "mean",
  "vocab_size": -1,
  "bos_token_id": 1,
  "cls_token_id": 1,
  "eos_token_id": 2,
  "sep_token_id": 2,
  "pad_token_id": 3,
  "num_attention_heads": 12,
  "num_hidden_layers": 22,
  "hidden_activation": "gelu",
  "hidden_size": 768,
  "max_position_embeddings": 8192,
  "global_attn_every_n_layers": 3,
  "global_rope_theta": 160000.0,
  "local_attention": 128,
  "local_rope_theta": 10000.0,
  "gradient_checkpointing": false,
  "initializer_cutoff_factor": 2.0,
  "initializer_range": 0.02,
  "intermediate_size": 1152,
  "layer_norm_eps": 1e-05,
  "mlp_bias": false,
  "mlp_dropout": 0.1,
  "model_type": "modernbert",
  "norm_bias": false,
  "norm_eps": 1e-05,
  "position_embedding_type": "absolute",
  "tie_word_embeddings": true,
  "torch_dtype": "float32",
  "transformers_version": "4.47.0.dev0"
}
